{
  "educations":  {
    "0": {
      "name": "Governor's School for Government and International Studioes",
      "dates": "Class of 1998",
      "description": "Highschool",
      "summary": "Ranked 13th nationally in 2013 by Newsweek and 10th by The Daily Best in 2014, Governor's School was were I was first introduced to computer programming and web development.",
      "location": "Richmond, VA"
    },
    "1": {
      "name": "Virginia Tech",
      "dates": "Jan 1999 - Dec 2000",
      "description": "Computer Science",
      "summary": "Focusing on C++ and computer science theory, I began my college education at Virgina Tech. Here I developed a strong base of object oriented programming and the theory driving most of computer science.",
      "location": "Blacksburg, VA"
    },
    "2": {
      "name": "Virginia Commonwealth University (VCU)",
      "dates": "Jan 2001 - May 2004",
      "description": "Bachelor's of Engineering in Computer Science",
      "summary": "After being offered an opportunity to convert a summer internship into a fulltime position in 2001, I transferred to VCU to continue my education.  Coding heavily in Java, I learned the importance of modular code and took courses focusing on artificial intelligence, parallel programming, and software design.",
      "location": "Richmond, VA"
    },
    "3": {
      "name": "Johns Hopkins University",
      "dates": "2014",
      "description": "Data Science Track",
      "summary": "Covering everything from getting and cleaning the data, analyzing the data, and making sure research was reproducable, these courses taught R and the ideas and procedures used to analyze sets of data. I achieved “100% with Distinction” grade from every course.",
      "location": "Online"
    },
    "4": {
      "name": "Massachusetts Institute of Technology (MIT)",
      "dates": "2014",
      "description": "Fundamentals of Computational Thinking and Data Science",
      "summary": "This course allowed me to reinforce my theoretical base in computer science. Utilizing Python, I worked to create many different theoretical models and enhanced the performance of Monte Carlo simulations and stochastic models.",
      "location": "Online"
    }
  },
  "jobs": {
    "0": {
      "name": "McKesson",
      "dates": "Jun 1999 - Sept 2005",
      "title": "Intern, Help Desk Lead, Systems Engineer",
      "summary": "I began my carrer in development and technology at McKesson as a summer intern analyzing systems and desktops for Y2K compliance. I worked in multiple roles from assisting the system administrators to helping start and build an internal corporate help desk. In 2004, upon graduating from college, I transferred internally to an office in Dallas, TX where I began working with the Tivoli suite of enterprise management products.",
      "location": "Richmond, VA & Dallas, TX",
      "website": "http://www.mckesson.com"
    },
    "1": {
      "name": "ASCAP",
      "dates": "Sept 2005 - Oct 2007",
      "title": "Consultant, Scheduling Specialist, Performance Testing",
      "summary": "ASCAP was in the middle of a project migrating their entire royalty calcualtion system from mainframe processing to a batch driven Java/Oracle system. I was hired to manage the entire Tivoli Workload Scheduler infrastructure. I was also utilized to run performance tests across the system and was integral in working to address significant areas needing improvement. With some rework on database connection logic, I was able to get one batch job down from just over a 25 hour runtime to around 30 minutes.",
      "location": "New York, NY",
      "website": "http://www.ascap.com/"
    },
    "2": {
      "name": "Jefferies",
      "dates": "Oct 2007 - Jan 2012",
      "title": "Fulltime - Lead Developer",
      "summary": "I began my work at Jefferies as a Tivoli Workload Scheduler specialist but almost immediately transitioned into the role of lead Perl developer. In this role, I built out an entire ETL system from scratch for pulling position data in from multiple sources in the firm and feeding into our Market Risk and Credit Risk applications. This ETL system eventually grew to support all corporate functions including both HR and Accounting.",
      "location": "New York, NY, Jersey City, NJ & Red Bank, NJ",
      "website": "http://www.jefferies.com/"
    },
    "3": {
      "name": "Seidel & Co",
      "dates": "Jan 2010 - ongoing",
      "title": "On Demand Consultant",
      "summary": "Seidel & Co is a brokerage firm in New York City that I consult for on various projects they need ranging from small projects such as parsing files received daily via email to building a custom trade entry system in Rails with user generated reports.",
      "location": "New York, NY",
      "website": "http://www.seidelco.com"
    },
    "4": {
      "name": "Citigroup",
      "dates": "Jan 2012 - Feb 2015",
      "title": "Consultat, Senior PL/SQL Developer",
      "summary": "At Citigroup, I worked on the Account Master Central (AMC) project which as the name suggests, is the central system for storing and accessing institutional account data. My work focused on PL/SQL Oracle develoment where I developed a quasi-CRUD interface to the database using custom record and collection types. I also worked directly with the messaging and cloud teams to ensure the data flowing from our system was timely and accurate. My third primary role involved leading a project to sync and integrate legacy functionality into the system and retire those legacy applications.",
      "location": "Warren, NJ",
      "website": "http://www.citigroup.com"
    },
    "5": {
      "name": "Brokerchat",
      "dates": "June 2012 - 2015",
      "title": "Owner, Sole Developer",
      "summary": "Brokerchat is a web application that allows for real time voice communication utilizing nothing but HTML and Javascript. The intent is to replace a system that costs firms thousands of dollars a month due to the reliance on phone lines and external hardware. I developed the full stack using Rails and Node.js to handle both messaging between clients using socket.io (user logged in, logged out, is away, etc) and the voice communication using WebRTC.",
      "location": "New York, NY",
      "website": "http://www.brokerchat.com/"
    },
    "6": {
      "name": "Picklejar",
      "dates": "Dec 2014 - ongoing",
      "title": "Owner, Sole Developer",
      "summary": "Picklejar is a web application and soon to be mobile application that allows users to save recipes from any site on the Internet.  This is done via a browser extension, a bookmarklet, or a quick action on mobile. Recipes will then be accessible from one location on any device with an internet connection or via the mobile app. Future enhancments include shopping lists and having a specific recipe shipped to you with the proper amount of each ingredient.",
      "location": "Keyport, NJ",
      "website": "http://www.getpicklejar.com/"
    },
    "7": {
      "name": "Datapipe",
      "dates": "Feb 2015 - Dec 2015",
      "title": "Senior Rails Developer, Hadoop Developer",
      "summary": "Datapipe is a cloud service provider and reseller. I worked in the Cloud Products group which supported an internal application used by finance and sales for billing and configuration and an external application used by customers. I was integral in implementing a big data project with Hadoop that saw us migrating from a summarized billing system with AWS to a detailed 75+ million record hourly usage report.",
      "location": "Somerset, NJ & Jersey City, NJ",
      "website": "http://www.datapipe.com/"
    },
    "8": {
      "name": "Liaison",
      "dates": "June 2015 - Sept 2015",
      "title": "Consultant",
      "summary": "Liaison provides a service to college applicants and to the programs within the universities allowing for an prospective student to fill out an application once and apply to multiple programs. While at Liaison, I was instrumental in testing full time pair programming that was eventually deemed to be a success. Day to day responsibilities included onboarding and configuration for new programs and feature enhancements for existing programs.",
      "location": "Remote",
      "website": "http://www.liaison-intl.com/"
    },
    "9": {
      "name": "Rollipoll",
      "dates": "Sept 2015 - ongoing",
      "title": "Consultant, Equity Owner",
      "summary": "Rollipoll is a service allowing content providers to create a customized poll which generates a html div that can be embedded in their pages. The unique aspect of this service is it allows social sharing after someone votes which drives traffic back to the site. I was brought in to perform optimizations on the number of Parse database connections and ended up decreasing the number of requests to Parse at a ratio of approximately 50 to 1.",
      "location": "New York, NY",
      "website": "http://www.rollipoll.com/"
    },
    "10": {
      "name": "Betwixt.us",
      "dates": "Dec 2015 - current",
      "title": "Senior Lead Developer, CTO",
      "summary": "Betwixt.us is a startup that focuses on making social networking at the professional level much more personable. I came into the project in December of 2015 as the first fulltime technical hire. Being the first technical hire, I wore multiple hats. My duties included full stack web development (Rails and React Javascript), dev-ops (administering and configuring stage and production deploys, monitoring, etc) and project maanagement (Jira was implemented along with Agile development methodology). I also have the opportunity to implement real time big data processing solutions as our useerbase grows utilizing multiple datapoints in a user personality matching algorithm.",
      "location": "New York, NY",
      "website": "http://app.betwixt.us/"
    }
  },
  "tools": {
    "0": {
      "name": "Google Chrome",
      "rating": "5"
    },
    "1": {
      "name": "Firefox",
      "rating": "5"
    },
    "2": {
      "name": "MS Office",
      "rating": "5"
    },
    "3": {
      "name": "Mac",
      "rating": "5"
    },
    "4": {
      "name": "Atom",
      "rating": "5"
    },
    "5": {
      "name": "Jira",
      "rating": "5"
    },
    "6": {
      "name": "Windows",
      "rating": "5"
    },
    "7": {
      "name": "Scrum",
      "rating": "5"
    },
    "8": {
      "name": "Github",
      "rating": "4"
    },
    "9": {
      "name": "Herok",
      "rating": "4"
    },
    "10": {
      "name": "Bitbucket",
      "rating": "4"
    },
    "11": {
      "name": "MAMP",
      "rating": "4"
    },
    "12": {
      "name": "AWS",
      "rating": "3"
    },
    "13": {
      "name": "Sublime Text",
      "rating": "3"
    },
    "14": {
      "name": "Subversion",
      "rating": "3"
    },
    "15": {
      "name": "Eclipse",
      "rating": "3"
    }
  },
  "skills": {
    "0": {
      "name": "Ruby",
      "rating": "5"
    },
    "1": {
      "name": "Rails",
      "rating": "5"
    },
    "2": {
      "name": "Rspec",
      "rating": "5"
    },
    "3": {
      "name": "HTML5",
      "rating": "5"
    },
    "4": {
      "name": "CSS3",
      "rating": "5"
    },
    "5": {
      "name": "Node.js",
      "rating": "4"
    },
    "6": {
      "name": "React",
      "rating": "4"
    },
    "7": {
      "name": "PL/SQL",
      "rating": "4"
    },
    "8": {
      "name": "Bootstrap",
      "rating": "4"
    },
    "9": {
      "name": "Command Line",
      "rating": "4"
    },
    "10": {
      "name": "jQuery",
      "rating": "4"
    },
    "11": {
      "name": "Java",
      "rating": "4"
    },
    "12": {
      "name": "Javascript",
      "rating": "4"
    },
    "13": {
      "name": "MySQL",
      "rating": "4"
    },
    "14": {
      "name": "Postgres",
      "rating": "4"
    },
    "15": {
      "name": "Scrum/Agile",
      "rating": "4"
    },
    "16": {
      "name": "Object Orientated Programming",
      "rating": "4"
    },
    "17": {
      "name": "Python",
      "rating": "3"
    },
    "18": {
      "name": "Hadoop (Pig/Impala/Hive/MapReduce)",
      "rating": "3"
    },
    "19": {
      "name": "Firebase",
      "rating": "4"
    },
    "20": {
      "name": "MongoDB",
      "rating": "3"
    },
    "21": {
      "name": "Firebase",
      "rating": "3"
    },
    "22": {
      "name": "Coffeescript",
      "rating": "3"
    },
    "23": {
      "name": "SASS",
      "rating": "3"
    },
    "24": {
      "name": "LESS",
      "rating": "3"
    },
    "25": {
      "name": "AngularJS",
      "rating": "2"
    },
    "26": {
      "name": "ElasticSearch",
      "rating": "2"
    },
    "27": {
      "name": "Wordpress",
      "rating": "2"
    }
  },
  "projects": {
    "0":  {
      "name": "PickleJar",
      "description": "A web/mobile app for saving recipies.",
      "tags": "Full Stack Development, Javascript, Rails, Mobile",
      "url": "http://www.getpicklejar.com",
      "image": "projects_picklejar.png"
    },
    "1":  {
      "name": "Rollipoll",
      "description": "An embeddable polling solution with social aspects.",
      "tags": "Node.js, Javascript, Optimization",
      "url": "http://www.rollipoll.com",
      "image": "projects_rollipoll.png"
    },
    "2":  {
      "name": "Betwixt.us",
      "description": "Webapp for faciliating networking in professional situations.",
      "tags": "Rails, React, Scrum, Project Management",
      "url": "http://app.betwixt.us",
      "image": "projects_betwixt.png"
    },
    "3":  {
      "name": "Datapipe",
      "description": "Built and supported internal system for billing and finance support.",
      "tags": "Development, Rails, Hadoop",
      "url": "http://www.datapipe.com",
      "image": "projects_datapipe.png"
    },
    "4":  {
      "name": "Brokerchat",
      "description": "Realtime voice chat utilizing HTML5 and Javascript.",
      "tags": "Rails, Javascript, WebRTC, Node.js",
      "url": "http://www.brokerchat.com",
      "image": "projects_brokerchat.png"
    },
    "5":  {
      "name": "Liaison",
      "description": "Supporting onboarding functionality of new universities and programs.",
      "tags": "Pair Programming, Rails, Support",
      "url": "http://www.liaison-intl.com/",
      "image": "projects_liaison.png"
    }
  }
}
